tangyangguang/Esp32Base/test/test_native_record_store_harness/test_main.cpp
void test_clear_hides_records_and_continues_ids() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.clear());
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::NotFound, store.readById(2, output, sizeof(output), record));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found, store.readById(3, output, sizeof(output), record));
}

void test_different_versions_use_different_directories() {
    Esp32BaseRecordStore first;
    Esp32BaseRecordStore second;
    TEST_ASSERT_TRUE(first.begin(definition("feeding", 1)));
    TEST_ASSERT_TRUE(second.begin(definition("feeding", 2)));
    TEST_ASSERT_NOT_EQUAL(0, std::strcmp(first.path(), second.path()));
    TEST_ASSERT_TRUE(Esp32BaseFs::exists(first.path()));
    TEST_ASSERT_TRUE(Esp32BaseFs::exists(second.path()));
}

void test_clearing_current_version_does_not_modify_historical_version() {
    Esp32BaseRecordStore historical;
    Esp32BaseRecordStore current;
    TEST_ASSERT_TRUE(historical.begin(definition("watering", 1)));
    TEST_ASSERT_TRUE(current.begin(definition("watering", 2)));
    uint8_t bytes[8];
    payload(bytes, 1);
    TEST_ASSERT_TRUE(historical.appendInstant(bytes, sizeof(bytes)));
    payload(bytes, 2);
    TEST_ASSERT_TRUE(current.appendInstant(bytes, sizeof(bytes)));

    TEST_ASSERT_TRUE(current.clear());
    Esp32BaseRecordStore::StoreStatus historicalStatus;
    Esp32BaseRecordStore::StoreStatus currentStatus;
    TEST_ASSERT_TRUE(historical.readStatus(historicalStatus));
    TEST_ASSERT_TRUE(current.readStatus(currentStatus));
    TEST_ASSERT_EQUAL_UINT32(1, historicalStatus.recordCount);
    TEST_ASSERT_EQUAL_UINT32(0, currentStatus.recordCount);
    TEST_ASSERT_EQUAL_UINT32(2, currentStatus.nextRecordId);

    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found,
                      historical.readById(1, output, sizeof(output), record));
}

void test_existing_control_wrong_size_is_not_rewritten() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    g_files[controlPath(store)].resize(100);
    TEST_ASSERT_FALSE(store.reload());
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::StructuralFault, store.state());
    TEST_ASSERT_EQUAL_UINT32(100, g_files[controlPath(store)].size());
}

void test_existing_definition_mismatch_is_not_rewritten() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    std::vector<uint8_t>& file = g_files[controlPath(store)];
    for (uint32_t copy = 0; copy < 2; ++copy) {
        uint8_t* header = file.data() + copy * 64U;
        recordStoreWriteU16(header + 8, 2);
        recordStoreWriteU32(header + 32, 0);
        recordStoreWriteU32(header + 32, recordStoreCrc(header, 64));
    }
    const std::vector<uint8_t> beforeReload = file;
    TEST_ASSERT_FALSE(store.reload());
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::DefinitionMismatch, store.lastError());
    TEST_ASSERT_EQUAL_UINT32(beforeReload.size(), g_files[controlPath(store)].size());
    TEST_ASSERT_EQUAL_UINT8_ARRAY(beforeReload.data(), g_files[controlPath(store)].data(), beforeReload.size());
}

void test_minimum_free_space_blocks_business_store_creation() {
    g_totalBytes = 200;
    Esp32BaseRecordStore store;
    TEST_ASSERT_FALSE(store.begin(definition("door-opening", 1, 224, 100)));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::InsufficientFreeSpace, store.lastError());
    TEST_ASSERT_FALSE(Esp32BaseFs::exists("/esp32base/records/door-opening.v1/control.bin"));
}

void test_latest_pagination_crosses_segments() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition("feeding", 1, 4320)));
    appendRecords(store, 1, 129);
    IdCollector collected;
    uint8_t scratch[8];
    TEST_ASSERT_TRUE(store.readLatest(1, 4, scratch, sizeof(scratch), collectId, &collected));
    TEST_ASSERT_EQUAL_UINT32(4, collected.ids.size());
    TEST_ASSERT_EQUAL_UINT32(128, collected.ids[0]);
    TEST_ASSERT_EQUAL_UINT32(127, collected.ids[1]);
    TEST_ASSERT_EQUAL_UINT32(126, collected.ids[2]);
    TEST_ASSERT_EQUAL_UINT32(125, collected.ids[3]);
}

void test_torn_clear_header_falls_back_to_pre_clear_state() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    const std::vector<uint8_t> oldSegment = g_files[segmentPath(store)];
    TEST_ASSERT_TRUE(store.clear());
    g_files[segmentPath(store)] = oldSegment;
    g_files[controlPath(store)][64] ^= 0x5A;
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found,
                      store.readById(1, output, sizeof(output), record));
}

void test_clear_boundary_stays_effective_when_segment_cleanup_fails() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition("watering", 1, 4320)));
    appendRecords(store, 1, 2);
    g_removeFailurePaths.insert(segmentPath(store));
    TEST_ASSERT_TRUE(store.clear());
    Esp32BaseRecordStore::StoreStatus status;
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::Degraded, status.state);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::CleanupFailed, status.error);
    TEST_ASSERT_EQUAL_UINT32(0, status.recordCount);
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::NotFound,
                      store.readById(1, output, sizeof(output), record));
    g_removeFailurePaths.clear();
    ++g_time.uptimeSec;
    uint8_t bytes[8]; payload(bytes, 3);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(1, status.recordCount);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found,
                      store.readById(3, output, sizeof(output), record));
    TEST_ASSERT_TRUE(store.reload());
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(1, status.recordCount);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::NotFound,
                      store.readById(2, output, sizeof(output), record));
}

void test_product_store_budgets_choose_bounded_segments() {
    Esp32BaseRecordStore::StoreDefinition watering;
    watering.recordTypeName = "watering-large";
    watering.storeVersion = 1;
    watering.payloadSizeBytes = 728;
    watering.maximumStoreBytes = 384UL * 1024UL;
    Esp32BaseRecordStore wateringStore;
    TEST_ASSERT_TRUE(wateringStore.begin(watering));
    Esp32BaseRecordStore::StoreStatus wateringStatus;
    TEST_ASSERT_TRUE(wateringStore.readStatus(wateringStatus));
    TEST_ASSERT_EQUAL_UINT32(32724, wateringStatus.segmentFileLimitBytes);
    TEST_ASSERT_TRUE(wateringStatus.capacity >= 516);

    Esp32BaseRecordStore::StoreDefinition audit;
    audit.recordTypeName = "compact-audit";
    audit.storeVersion = 1;
    audit.payloadSizeBytes = 40;
    audit.maximumStoreBytes = 128UL * 1024UL;
    Esp32BaseRecordStore auditStore;
    TEST_ASSERT_TRUE(auditStore.begin(audit));
    Esp32BaseRecordStore::StoreStatus auditStatus;
    TEST_ASSERT_TRUE(auditStore.readStatus(auditStatus));
    TEST_ASSERT_EQUAL_UINT32(16368, auditStatus.segmentFileLimitBytes);
    TEST_ASSERT_TRUE(auditStatus.capacity > 1000);

    Esp32BaseRecordStore::StoreDefinition singleLarge = watering;
    singleLarge.recordTypeName = "watering-only";
    singleLarge.maximumStoreBytes = 512UL * 1024UL;
    Esp32BaseRecordStore singleLargeStore;
    TEST_ASSERT_TRUE(singleLargeStore.begin(singleLarge));
    Esp32BaseRecordStore::StoreStatus singleLargeStatus;
    TEST_ASSERT_TRUE(singleLargeStore.readStatus(singleLargeStatus));
    TEST_ASSERT_EQUAL_UINT32(65432, singleLargeStatus.segmentFileLimitBytes);
    TEST_ASSERT_TRUE(singleLargeStatus.capacity >= 688);
}

void test_condition_activation_recovery_and_reactivation_are_debounced() {
    TEST_ASSERT_TRUE(Esp32BaseConditions::begin());
    Esp32BaseConditions::ConditionTracker tracker(1, 1000, 2000);

    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::ActivationConfirmationPending,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Active));
    nativeMillisValue() = 999;
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::ActivationConfirmationPending,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Active));
    nativeMillisValue() = 1000;
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::Activated,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Active));
    TEST_ASSERT_EQUAL_UINT32(1, g_conditionStateWriteCount);

    bool active = false;
    TEST_ASSERT_TRUE(Esp32BaseConditions::isActive(1, active));
    TEST_ASSERT_TRUE(active);
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::ConditionUnchanged,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Active));
    TEST_ASSERT_EQUAL_UINT32(1, g_conditionStateWriteCount);

